In [2]:
import pandas

In [3]:
dict={"name":["roshani","sagar","savi"],"age":[23,34,45]}
dict

{'name': ['roshani', 'sagar', 'savi'], 'age': [23, 34, 45]}

In [4]:
df=pandas.DataFrame(dict)

In [5]:
df

      name  age
0  roshani   23
1    sagar   34
2     savi   45

In [6]:
# use alias
import pandas as pd

In [7]:
d={"id":[1,2,3],"name":["rakesh","bhavesh","rupesh"]}

In [8]:
d

{'id': [1, 2, 3], 'name': ['rakesh', 'bhavesh', 'rupesh']}

In [ ]:
df=pd.DataFrame("